nxp-appcodehub/dm-mcxn947-power-manager/components/power_manager/core/fsl_pm_core.c
    /* Clear handle. */
    (void)memset(handle, 0, sizeof(*handle));

    handle->enable = false;
    /* Initial value is set to 1 as Power Manager is disabled by default */
    handle->disableCount = 1;
    handle->deviceOption = &g_devicePMOption;
#if (defined(FSL_PM_SUPPORT_LP_TIMER_CONTROLLER) && FSL_PM_SUPPORT_LP_TIMER_CONTROLLER)
    handle->timerStart       = NULL;
    handle->timerStop        = NULL;
    handle->getTimerDuration = NULL;
    handle->getTimestamp     = NULL;
#endif /* FSL_PM_SUPPORT_LP_TIMER_CONTROLLER */

    handle->enterCritical = PM_EnterCriticalDefault;
    handle->exitCritical  = PM_ExitCriticalDefault;

#if (defined(FSL_PM_SUPPORT_NOTIFICATION) && FSL_PM_SUPPORT_NOTIFICATION)
    /* Create notify lists. */
    LIST_Init((list_handle_t) & (handle->notifyList[kPM_NotifyGroup0]), 0UL);
    LIST_Init((list_handle_t) & (handle->notifyList[kPM_NotifyGroup1]), 0UL);
    LIST_Init((list_handle_t) & (handle->notifyList[kPM_NotifyGroup2]), 0UL);
#endif /* FSL_PM_SUPPORT_NOTIFICATION */

#if (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER)
    LIST_Init((list_handle_t) & (handle->wakeupSourceList), 0UL);
#endif /* FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER */

    s_pmHandle = handle;

    /* Need to clean some device register for proper functioning */
    /*
     * $Branch Coverage Justification$
     * $ref pm_core_c_ref_1$.
     */
    if (s_pmHandle->deviceOption->clean != NULL)
    {
        s_pmHandle->deviceOption->clean();
    }

    PM_SetAllowedLowestPowerMode();
}

/*!
 * brief Enable/disable power manager functions.
 *
 * param enable Used to enable/disable power manager functions.
 */
void PM_EnablePowerManager(bool enable)
{
    /* Check whether Power Manager has been initialized or not */
    assert(s_pmHandle != NULL);

    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

    if (enable == true)
    {
        assert(s_pmHandle->disableCount > 0);

        s_pmHandle->disableCount--;

        if (s_pmHandle->disableCount == 0)
        {
            s_pmHandle->enable = true;
        }
    }
    else
    {
        s_pmHandle->disableCount++;

        if (s_pmHandle->disableCount >= 1)
        {
            s_pmHandle->enable = false;
        }
    }

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }
}

/*!
 * brief Power manager core API, this API should be used on RTOS's IDLE task.
 *
 * This function contains several steps:
 * 1. Compute target power state based on the policy module.
 * 2. Notify upper layer software of the power mode entering.
 * 3. Enter into target power state.
 * 4. Exit from low power state, if wakeup event occurred.
 * 5. Notify upper layer software of the power mode exiting.
 *
 * The target power state is determined based on two factors:
 *   a. The input parameter should be larger than state's exitLatency attribution.
 *   b. resConstraintsMask logical AND state's lossFeature should equal to 0, because constraint can be understand as
 * some features can not loss.
 *
 * param duration The time in low power mode, this value is calculate from RTOS API.
 */
void PM_EnterLowPower(uint64_t duration)
{
    uint8_t stateIndex;
    status_t status = kStatus_PMSuccess;
    pm_deepest_state_results_t results;

    if (s_pmHandle->enable)
    {
        /* 1. Based on duration and system constraints compute the next allowed deepest power state. */
        PM_findDeepestState(duration, &results);
        stateIndex = results.deepestState;

        if (stateIndex != 0xFFU)
        {
            s_pmHandle->targetState = stateIndex;

#if (defined(FSL_PM_SUPPORT_NOTIFICATION) && FSL_PM_SUPPORT_NOTIFICATION)
            /* Notify the enter of power state */
            status = PM_notifyPowerStateEntry(stateIndex);
#endif /* FSL_PM_SUPPORT_NOTIFICATION */

            if (status == kStatus_PMSuccess)
            {
#if (defined(FSL_PM_SUPPORT_LP_TIMER_CONTROLLER) && FSL_PM_SUPPORT_LP_TIMER_CONTROLLER)
                if (s_pmHandle->getTimestamp != NULL)
                {
                    s_pmHandle->entryTimestamp = s_pmHandle->getTimestamp();
                }

                /* Start low power timer if needed */
                if (s_pmHandle->timerStart != NULL)
                {
                    s_pmHandle->timerStart(duration - (s_pmHandle->deviceOption->states[stateIndex].exitLatency));
                }
#endif /* FSL_PM_SUPPORT_LP_TIMER_CONTROLLER */

                /* Enter into low power state. */
                s_pmHandle->deviceOption->enter(stateIndex, &s_pmHandle->softConstraints, &s_pmHandle->sysRescGroup);

#if (defined(FSL_PM_SUPPORT_LP_TIMER_CONTROLLER) && FSL_PM_SUPPORT_LP_TIMER_CONTROLLER)
                /* Stop low power timer if it is started */
                if (s_pmHandle->timerStop != NULL)
                {
                    s_pmHandle->timerStop();
                }

                if (s_pmHandle->getTimestamp != NULL)
                {
                    s_pmHandle->exitTimestamp = s_pmHandle->getTimestamp();
                }
#endif /* FSL_PM_SUPPORT_LP_TIMER_CONTROLLER */
            }

#if (defined(FSL_PM_SUPPORT_NOTIFICATION) && FSL_PM_SUPPORT_NOTIFICATION)
            /* Notify the exit of power state. */
            (void)PM_notifyPowerStateExit(stateIndex);
#endif /* FSL_PM_SUPPORT_NOTIFICATION */

            /*
             * $Branch Coverage Justification$
             * $ref pm_core_c_ref_1$.
             */
            if (s_pmHandle->deviceOption->clean != NULL)
            {
                s_pmHandle->deviceOption->clean();
            }
        }
    }
}

#if (defined(FSL_PM_SUPPORT_LP_TIMER_CONTROLLER) && FSL_PM_SUPPORT_LP_TIMER_CONTROLLER)
/*!
 * brief Register timer controller related functions to power manager.
 *
 * If low power timer is the wakeup source, please remember to register it into power manager by using
 * PM_RegisterWakeupSource() function.
 *
 * param handle Pointer to the pm_handle_t structure
 * param timerStart Low power timer start function, this parameter can be NULL, and it means low power timer is not set
 *  as the wakeup source.
 * param timerStop Low power timer stop function, this parameter can also be set as NULL.
 * param timerSync Low power timer sync function, this parameter can also be set as NULL.
 * param getTimestamp Low power timestamp function, this parameter can also be set as NULL.
 * param getTimerDuration Get timer count function. this parameter can also be set as NULL.
 */
void PM_RegisterTimerController(pm_handle_t *handle,
                                pm_low_power_timer_start_func_t timerStart,
                                pm_low_power_timer_stop_func_t timerStop,
                                pm_low_power_timer_get_timestamp_func_t getTimestamp,
                                pm_low_power_timer_get_duration_func_t getTimerDuration)
{
    assert(handle != NULL);

    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

    handle->timerStart       = timerStart;
    handle->timerStop        = timerStop;
    handle->getTimerDuration = getTimerDuration;
    handle->getTimestamp     = getTimestamp;

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }
}

void PM_RegisterCriticalRegionController(pm_handle_t *handle,
                                         pm_enter_critical criticalEntry,
                                         pm_exit_critical criticalExit)
{
    assert(handle != NULL);

    handle->enterCritical = criticalEntry;
    handle->exitCritical  = criticalExit;
}

/*!
 * brief Get the actual low power state duration.
 */
uint64_t PM_GetLastLowPowerDuration(void)
{
    return s_pmHandle->getTimerDuration(s_pmHandle->entryTimestamp, s_pmHandle->exitTimestamp);
}
#endif /* FSL_PM_SUPPORT_LP_TIMER_CONTROLLER */

#if (defined(FSL_PM_SUPPORT_NOTIFICATION) && FSL_PM_SUPPORT_NOTIFICATION)
/*!
 * brief Register notify element into the selected group.
 *
 * param groupId The group of the notify list, this will affect the execution sequence.
 * param notifyElement The pointer to pm_notify_element_t.
 * return status_t The status of register notify object behavior.
 */
status_t PM_RegisterNotify(pm_notify_group_t groupId, pm_notify_element_t *notifyElement)
{
    assert(notifyElement != NULL);

