nxp-appcodehub/dm-mcxn947-power-manager/components/power_manager/core/fsl_pm_core.c
    status_t status = kStatus_PMSuccess;

    if (LIST_AddTail((list_handle_t) & (s_pmHandle->notifyList[groupId]),
                     (list_element_handle_t) & (notifyElement->link)) != kLIST_Ok)
    {
        status = kStatus_PMFail;
    }

    return status;
}

/*!
 * brief Update notify element's callback function and application data.
 *
 * param notifyElement The pointer to the notify element to update.
 * param callback The callback function to be updated.
 * param data Pointer to the callback function private data.
 */
void PM_UpdateNotify(void *notifyElement, pm_notify_callback_func_t callback, void *data)
{
    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

    ((pm_notify_element_t *)notifyElement)->data           = data;
    ((pm_notify_element_t *)notifyElement)->notifyCallback = callback;

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }
}

/*!
 * brief Remove notify element from its notify group.
 *
 * param notifyElement The pointer to the notify element to remove.
 */
status_t PM_UnregisterNotify(void *notifyElement)
{
    status_t status = kStatus_PMSuccess;

    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

    if (LIST_RemoveElement((list_element_handle_t) & (((pm_notify_element_t *)notifyElement)->link)) != kLIST_Ok)
    {
        status = kStatus_PMFail;
    }

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }

    return status;
}
#endif /* FSL_PM_SUPPORT_NOTIFICATION */

#if (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER)
/*!
 * brief Initialize the wakeup source object.
 *
 * param ws    Pointer to the pm_wakeup_source_t variable.
 * param wsId  Used to select the wakeup source, the wsId of each wakeup source can be found in fsl_pm_board.h
 * param service The function to be invoked when wake up source asserted.
 * param enable Used to enable/disable the selected wakeup source.
 */
void PM_InitWakeupSource(pm_wakeup_source_t *ws, uint32_t wsId, pm_wake_up_source_service_func_t service, bool enable)
{
    assert(ws != NULL);

    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

    ws->wsId    = wsId;
    ws->service = service;
    ws->enabled = enable;
    ws->active  = false;

    if (enable == true)
    {
        (void)LIST_AddTail((list_handle_t) & (s_pmHandle->wakeupSourceList), (list_element_handle_t) & (ws->link));
    }

    (void)(s_pmHandle->deviceOption->manageWakeupSource(ws, enable));

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }
}

/*!
 * brief Enable wakeup source.
 *
 * param ws Pointer to the wakeup source object to be enabled.
 * return status_t The status of enable wakeup source behavior.
 */
status_t PM_EnableWakeupSource(pm_wakeup_source_t *ws)
{
    assert(ws != NULL);

    status_t status = kStatus_PMSuccess;

    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

    if (!(ws->enabled))
    {
        /* Add wake up source to list so PM can parse the list if wake up event
         * occurs, and trigger the service callback if needed */
        (void)LIST_AddTail((list_handle_t) & (s_pmHandle->wakeupSourceList), (list_element_handle_t) & (ws->link));
        status = s_pmHandle->deviceOption->manageWakeupSource(ws, true);

        if (status == kStatus_Success)
        {
            ws->enabled = true;
        }
        else
        {
            /*
             * $Line Coverage Justification$
             * $ref pm_core_c_ref_2$.
             */
            status = kStatus_PMWakeupSourceEnableError;
        }
    }

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }

    return status;
}

/*!
 * brief Disable wakeup source
 *
 * param ws Pointer to the wakeup source object to be disabled.
 * return status_t The status of disable wakeup source behavior.
 */
status_t PM_DisableWakeupSource(pm_wakeup_source_t *ws)
{
    assert(ws != NULL);

    status_t status = kStatus_PMSuccess;

    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

    if (ws->enabled)
    {
        /* Remove the wake up source from the list */
        (void)LIST_RemoveElement((list_element_handle_t) & (ws->link));
        status = s_pmHandle->deviceOption->manageWakeupSource(ws, false);

        if (status == kStatus_Success)
        {
            ws->enabled = false;
        }
        else
        {
            /*
             * $Line Coverage Justification$
             * $ref pm_core_c_ref_2$.
             */
            status = kStatus_PMWakeupSourceDisableError;
        }
    }

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }

    return status;
}

/*!
 * brief Checks if any enabled wake up source is responsible for last wake up
 *       event. In such case, it will call the wake up source callback if it
 *       has been registered. Likely to be called from Wake Up Unit IRQ Handler.
 *
 * return status_t The status of handling the wake up event.
 */
status_t PM_HandleWakeUpEvent(void)
{
    status_t status = kStatus_PMSuccess;
    pm_wakeup_source_t *currWakeUpSource;

    if (LIST_GetSize((list_handle_t) & (s_pmHandle->wakeupSourceList)) != 0UL)
    {
        currWakeUpSource = (pm_wakeup_source_t *)(void *)(s_pmHandle->wakeupSourceList.head);

        /* the list should contain only enabled ws */
        assert(currWakeUpSource->enabled == true);

        do
        {
            if (currWakeUpSource->service != NULL)
            {
                if (s_pmHandle->deviceOption->isWakeupSource(currWakeUpSource) == true)
                {
                    /* The wake up source trigger the last wake up event
                     * we can call the callback */
                    status = PM_TriggerWakeSourceService(currWakeUpSource);
                }
            }

