nxp-appcodehub/dm-mcxn947-power-manager/components/power_manager/core/fsl_pm_core.c
            currWakeUpSource = (pm_wakeup_source_t *)(void *)currWakeUpSource->link.next;
        } while (currWakeUpSource != NULL);
    }

    return status;
}

/*!
 * brief If the specfic wakeup event occurs, invoke this API to execute its service function.
 *
 * param ws Pointer to the wakeup source object.
 * return status_t The status of trigger wakeup source behavior.
 */
status_t PM_TriggerWakeSourceService(pm_wakeup_source_t *ws)
{
    assert(ws != NULL);

    status_t status = kStatus_PMSuccess;

    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

    if (ws->enabled)
    {
        if (ws->active)
        {
            status = kStatus_PMWakeupSourceServiceBusy;
        }
        else
        {
            ws->active = true;
            ws->service();
            ws->active = false;

            status = kStatus_PMSuccess;
        }
    }
    else
    {
        /*
         * $Line Coverage Justification$
         * $ref pm_core_c_ref_2$.
         */
        status = kStatus_PMWakeupSourceEnableError;
    }

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }

    return status;
}
#endif /* FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER */

/*!
 * brief Used to set constraints(including power mode constraint and resource constraints)
 *
 * For example, if the board support 3 resource constraints: PM_RESC_1, PM_RESC_2, PM_RESC3
 *  code
 *      PM_SetConstraints(Sleep_Mode, 3, PM_RESC_1, PM_RESC_2, PM_RESC_3);
 *  endcode
 *
 * param powerModeConstraint The lowest power mode allowed, the power mode constraint macros
 *                            can be found in fsl_pm_board.h
 * param rescNum The number of resource constraints to be set.
 * return status_t The status of set constraints behavior.
 */
status_t PM_SetConstraints(uint8_t powerModeConstraint, int32_t rescNum, ...)
{
    status_t ret = kStatus_Success;
    uint32_t opMode;
    uint32_t rescShift;
    int32_t inputResc;
    va_list ap;
    int32_t i;
    uint32_t curRescOpMode;
    uint32_t opModeToSet;

    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

    if (powerModeConstraint != PM_LP_STATE_NO_CONSTRAINT)
    {
        if (powerModeConstraint >= PM_LP_STATE_COUNT)
        {
            /* wrong power mode index passed in parameter */
            ret = kStatus_Fail;
        }
        else
        {
            /* Set power mode constraint */
            s_pmHandle->powerModeConstraintCount[powerModeConstraint]++;
            PM_SetAllowedLowestPowerMode();
        }
    }
    else
    {
        /* No power mode constraint to apply, only ressource constraints */
        ;
    }

    if (rescNum != 0)
    {
        va_start(ap, rescNum);

        for (i = 0; i < rescNum; i++)
        {
            inputResc = (int32_t)va_arg(ap, int32_t);
            PM_DECODE_RESC(inputResc);

            assert(rescShift < (uint32_t)PM_CONSTRAINT_COUNT);
            curRescOpMode = s_pmHandle->sysRescGroup.groupSlice[rescShift / 8UL];
            opModeToSet   = ((uint32_t)opMode << (4UL * ((uint32_t)rescShift % 8UL)));
            if ((curRescOpMode & opModeToSet) == 0UL)
            {
                s_pmHandle->sysRescGroup.groupSlice[rescShift / 8UL] |=
                    ((uint32_t)opMode << (4UL * ((uint32_t)rescShift % 8UL)));
                s_pmHandle->resConstraintCount[rescShift]++;
                s_pmHandle->resConstraintMask.rescMask[rescShift / 32UL] |= (1UL << ((uint32_t)rescShift % 32UL));
            }
        }
        va_end(ap);
    }

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }

    return ret;
}

/*!
 * brief Used to release constraints(including power mode constraint and resource constraints)
 *
 * For example, if the board support 3 resource constraints: PM_RESC_1, PM_RESC_2, PM_RESC3
 *  code
 *      PM_ReleaseConstraints(Sleep_Mode, 1, PM_RESC_1);
 *  endcode
 *
 * param powerModeConstraint The lowest power mode allowed, the power mode constraint macros
 *                            can be found in fsl_pm_board.h
 * param rescNum The number of resource constraints to be released.
 * return status_t The status of set constraints behavior.
 */
status_t PM_ReleaseConstraints(uint8_t powerModeConstraint, int32_t rescNum, ...)
{
    status_t ret = kStatus_Success;
    uint32_t opMode;
    uint32_t rescShift;
    int32_t inputResc;
    va_list ap;
    int32_t i;
    uint32_t curRescOpMode;
    uint32_t opModeToRelease;

    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

    if (powerModeConstraint != PM_LP_STATE_NO_CONSTRAINT)
    {
        if (powerModeConstraint >= PM_LP_STATE_COUNT)
        {
            /* wrong power mode index passed in parameter */
            ret = kStatus_Fail;
        }
        else
        {
            /* Release power mode constraint */
            if (s_pmHandle->powerModeConstraintCount[powerModeConstraint] > 0U)
            {
                s_pmHandle->powerModeConstraintCount[powerModeConstraint]--;
            }
            PM_SetAllowedLowestPowerMode();
        }
    }
    else
    {
        /* No power mode constraint to release, only ressource constraints */
        ;
    }

    if (rescNum != 0)
    {
        va_start(ap, rescNum);

        for (i = 0; i < rescNum; i++)
        {
            inputResc = (int32_t)va_arg(ap, int32_t);
            PM_DECODE_RESC(inputResc);

            curRescOpMode   = s_pmHandle->sysRescGroup.groupSlice[rescShift / 8UL];
            opModeToRelease = ((uint32_t)opMode << (4UL * ((uint32_t)rescShift % 8UL)));
            if ((curRescOpMode & opModeToRelease) != 0UL)
            {
                s_pmHandle->sysRescGroup.groupSlice[rescShift / 8UL] &=
                    ~((uint32_t)opMode << (4UL * ((uint32_t)rescShift % 8UL)));
                if (s_pmHandle->resConstraintCount[rescShift] == 1UL)
                {
                    s_pmHandle->resConstraintMask.rescMask[rescShift / 32UL] &= ~(1UL << ((uint32_t)rescShift % 32UL));
                }
                s_pmHandle->resConstraintCount[rescShift]--;
            }
        }
        va_end(ap);
    }

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }

    return ret;
}

/*!
 * brief Get current system resource constraints.
 *
 * return Current system constraints.
 */
pm_resc_mask_t PM_GetResourceConstraintsMask(void)
{
    return s_pmHandle->resConstraintMask;
}

/*!
 * brief Get current system allowed power mode.
 *
 * return Allowed lowest power mode.
 */
uint8_t PM_GetAllowedLowestPowerMode(void)
{
    return s_pmHandle->powerModeConstraint;
}
